# Basic EDA 
> ดูข้อมูลพื้นฐานแบบ single file

In [ ]:
import pandas as pd
import numpy as np

In [7]:
book_df = pd.read_csv('../dataset/Books.csv')
ratings_df = pd.read_csv('../dataset/Ratings.csv')
user_df = pd.read_csv('../dataset/Users.csv')

C:\Users\surap\AppData\Local\Temp\ipykernel_28948\1962976078.py:1: DtypeWarning: Columns (0: Year-Of-Publication) have mixed types. Specify dtype option on import or set low_memory=False.
  book_df = pd.read_csv('../dataset/Books.csv')

## Books

In [6]:
book_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  str
 1   Book-Title           271360 non-null  str
 2   Book-Author          271358 non-null  str
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  str
 5   Image-URL-S          271360 non-null  str
 6   Image-URL-M          271360 non-null  str
 7   Image-URL-L          271357 non-null  str
dtypes: object(1), str(7)
memory usage: 16.6+ MB

for web, keep it <br>
for Datasci must clean<br>
<br>
Publisher null 2 <br>
Book-Auther null 2 <br>
Image-URL-L null 3

- drop URL attribute
- drop duplicate name of book
- fill missing in auther and publisher with MODE

In [40]:
# drop URL attribute
pure_book_df = book_df.copy()
pure_book_df.drop(columns=["Image-URL-S", "Image-URL-M" , "Image-URL-L"],inplace = True)

In [41]:
pure_book_df.head(3)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial

In [42]:
# drop duplicated "NAME" of book

# see how much dup
print('Num of Duplicated Books: ',pure_book_df['Book-Title'].duplicated().sum())
pure_book_df.drop_duplicates(subset= ["Book-Title"],inplace= True)

Num of Duplicated Books:  29225

In [43]:
# see how much dup, should 0
print('Num of Duplicated Books: ',pure_book_df['Book-Title'].duplicated().sum())

Num of Duplicated Books:  0

In [44]:
pure_book_df.head(3)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial

In [45]:
pure_book_df.info()

<class 'pandas.DataFrame'>
Index: 242135 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 242135 non-null  str
 1   Book-Title           242135 non-null  str
 2   Book-Author          242133 non-null  str
 3   Year-Of-Publication  242135 non-null  object
 4   Publisher            242134 non-null  str
dtypes: object(1), str(4)
memory usage: 11.1+ MB

In [46]:
'''
 Count จำนวน
 unique ตามนั้น
 top คือ mode
 freq คือ count ของ mode

 ISBN กับ Book-Title ไม่มี mode
'''

pure_book_df.describe()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
count,242135,242135,242133,242135,242134
unique,242135,242135,99684,192,16461
top,0195153448,Classical Mythology,William Shakespeare,2002,Harlequin
freq,1,1,491,12507,7414

In [47]:
# There is 2 missing values in author and 1 missing value in Publisher lets fill them mode

most_frequent_author = pure_book_df["Book-Author"].mode()[0]
most_frequent_publisher = pure_book_df["Publisher"].mode()[0]

In [48]:
pure_book_df["Book-Author"] = pure_book_df["Book-Author"].fillna(most_frequent_author)
pure_book_df["Publisher"] = pure_book_df["Publisher"].fillna(most_frequent_publisher)

In [49]:
pure_book_df.info()

<class 'pandas.DataFrame'>
Index: 242135 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 242135 non-null  str
 1   Book-Title           242135 non-null  str
 2   Book-Author          242135 non-null  str
 3   Year-Of-Publication  242135 non-null  object
 4   Publisher            242135 non-null  str
dtypes: object(1), str(4)
memory usage: 11.1+ MB

## User

In [50]:
user_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  int64
 1   Location  278858 non-null  str
 2   Age       168096 non-null  float64
dtypes: float64(1), int64(1), str(1)
memory usage: 6.4 MB

In [51]:
user_df.head(3)

   User-ID                         Location   Age
0        1               nyc, new york, usa   NaN
1        2        stockton, california, usa  18.0
2        3  moscow, yukon territory, russia   NaN

In [52]:
# In the Location feature we what to just take the country name 
user_df["Country"] = user_df["Location"].str.split(",").str[-1].str.strip().str.capitalize()

In [53]:
user_C = user_df.copy()
user_C.drop(columns= ["Location"],inplace =True)

In [54]:
user_C["Country"].value_counts()

Country
Usa                139711
Canada              21658
United kingdom      18538
Germany             17043
Spain               13147
                    ...
Victoria                1
Bkk                     1
La svizzera             1
Hernando                1
United kingdom.         1
Name: count, Length: 709, dtype: int64

In [55]:
user_C["Age"].isnull().sum()

np.int64(110762)

## Rating

In [57]:
ratings_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  str
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), str(1)
memory usage: 26.3 MB

In [56]:
ratings_df.head(3)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0

In [58]:
ratings_given = ratings_df.groupby("User-ID")["ISBN"].count().sort_values(ascending=False)

In [59]:
ratings_given[ratings_given >8000].count()

np.int64(1)

In [60]:
valid_user_index = ratings_given[ratings_given>50].index

In [61]:
valid_user_index

Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352, 110973,
       235105,
       ...
       138138, 195079, 167521,  14966, 220911, 213119,  91130, 167478, 159455,
       255648],
      dtype='int64', name='User-ID', length=3371)

In [62]:
updated_rating = ratings_df[ratings_df["User-ID"].isin(valid_user_index)].reset_index(drop =True)

In [63]:
updated_rating.head(10)

   User-ID        ISBN  Book-Rating
0   276847  0446364193            0
1   276847  3257200552            5
2   276847  3379015180            0
3   276847  3404145909            8
4   276847  3404148576            8
5   276847  3404921178            7
6   276847  3423071516           10
7   276847  3423204885            0
8   276847  3423205806            0
9   276847  3426029553            8

In [64]:
avg_rating = updated_rating.groupby("ISBN")["Book-Rating"].mean()

In [65]:
avg_rating.sort_values(ascending=False)

ISBN
O439060737       10.0
SBN67001026X     10.0
0898041457       10.0
0898041465       10.0
0898041473       10.0
                 ...
T110105305048     0.0
SELBSTVERLAG      0.0
SBN425037452      0.0
0553406140        0.0
ZR902CX0093       0.0
Name: Book-Rating, Length: 265499, dtype: float64

In [66]:
avg_rating

ISBN
 0330299891    0.0
 0375404120    1.5
 0586045007    0.0
 9022906116    3.5
 9032803328    0.0
              ...
`3502103682    0.0
b00005wz75     0.0
cn108465       0.0
cn113107       0.0
Ô½crosoft      7.0
Name: Book-Rating, Length: 265499, dtype: float64

In [67]:
a = avg_rating.to_frame()
a.value_counts()

Book-Rating
0.000000       142993
8.000000        12989
10.000000       12743
5.000000        11877
7.000000         9821
                ...
0.090909            1
5.909091            1
6.307692            1
6.300000            1
7.857143            1
Name: count, Length: 2704, dtype: int64